In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("life_expectancy.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    object
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(5)
memory usage: 4.8+ KB

In [4]:
df

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong *,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao *,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [5]:
df.head()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong *,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao *,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰

In [6]:
df.tail()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    object
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(5)
memory usage: 4.8+ KB

In [8]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: object

In [9]:
df["Country"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 120 entries, 0 to 119
Series name: Country
Non-Null Count  Dtype
--------------  -----
120 non-null    object
dtypes: object(1)
memory usage: 1.1+ KB

In [10]:
df[["Country"]]

                   Country
0              Hong Kong *
1                  Macao *
2              Switzerland
3                  Iceland
4                   Norway
..                     ...
115  Congo (Dem. Republic)
116               Zimbabwe
117                Somalia
118                Nigeria
119                   Chad

[120 rows x 1 columns]

In [11]:
df[["Country"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  120 non-null    object
dtypes: object(1)
memory usage: 1.1+ KB

In [12]:
df["Country"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 120 entries, 0 to 119
Series name: Country
Non-Null Count  Dtype
--------------  -----
120 non-null    object
dtypes: object(1)
memory usage: 1.1+ KB

In [13]:
df.max()

Country                      Zimbabwe
Life expectancy males      83.2 years
Life expectancy females    87.9 years
Birth rate                      9.8 ‰
Death rate                      9.9 ‰
dtype: object

In [14]:
df.min()

Country                    Afghanistan
Life expectancy males       50.8 years
Life expectancy females     53.1 years
Birth rate                      10.0 ‰
Death rate                       1.3 ‰
dtype: object

# Data Cleaning

## Country

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    object
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(5)
memory usage: 4.8+ KB

In [16]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: object

In [17]:
df[["Country"]]

                   Country
0              Hong Kong *
1                  Macao *
2              Switzerland
3                  Iceland
4                   Norway
..                     ...
115  Congo (Dem. Republic)
116               Zimbabwe
117                Somalia
118                Nigeria
119                   Chad

[120 rows x 1 columns]

Convert this to string datatype

In [18]:
df.describe()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
count,120,120,120,120,120
unique,120,100,98,96,82
top,Hong Kong *,66.1 years,76.4 years,9.6 ‰,6.8 ‰
freq,1,3,3,4,5

In [19]:
df["Country"].astype("string")

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: string

In [20]:
df["Country"] = df["Country"].astype("string")

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    string
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(4), string(1)
memory usage: 4.8+ KB

In [22]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: string

In [23]:
df["Country"] = df["Country"].str.strip(to_strip = " ")

In [24]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: string

## Finding Null Values

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    string
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(4), string(1)
memory usage: 4.8+ KB

In [26]:
df[df["Country"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [27]:
df[df["Life expectancy males"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [28]:
df[df["Life expectancy females"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [29]:
df[df["Birth rate"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [30]:
df[df["Death rate"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

## Changing Values 0 and 1

In [31]:
df.loc[[0], ["Country"]] = "Hong Kong"
df.loc[[0], ["Country"]]

     Country
0  Hong Kong

In [32]:
df.loc[[1], ["Country"]] = "Macao"
df.loc[[1], ["Country"]]

  Country
1   Macao

In [33]:
df

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

## Now changing Life Expectency For both males and females

In [34]:
df.head()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰

In [35]:
df.replace("Norway", "This is the error")

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,This is the error,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [36]:
df["Life expectancy males"].astype("string")

0      83.2 years
1      82.8 years
2      81.9 years
3      81.8 years
4      81.7 years
          ...
115    57.0 years
116    56.2 years
117    53.2 years
118    52.3 years
119    50.8 years
Name: Life expectancy males, Length: 120, dtype: string

In [37]:
df["Life expectancy females"].astype("string")

0      87.9 years
1      87.9 years
2      85.9 years
3      84.5 years
4      84.7 years
          ...
115    61.5 years
116    62.0 years
117    57.4 years
118    53.1 years
119    54.3 years
Name: Life expectancy females, Length: 120, dtype: string

In [38]:
df["Life expectancy males"] = df["Life expectancy males"].astype("string")
df["Life expectancy females"] = df["Life expectancy females"].astype("string")

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    string
 1   Life expectancy males    120 non-null    string
 2   Life expectancy females  120 non-null    string
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(2), string(3)
memory usage: 4.8+ KB

In [46]:
df["Life expectancy males"].str.contains("years")
df[df["Life expectancy males"].str.contains("years", na = False)]

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [47]:
df["Life expectancy females"].str.contains("years")
df[df["Life expectancy females"].str.contains("years", na = False)]

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [54]:
df["Life expectancy males"] = df["Life expectancy males"].str.replace("years", "")

In [55]:
df["Life expectancy females"] = df["Life expectancy females"].str.replace("years", "")

In [56]:
df

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2,87.9,5.0 ‰,6.9 ‰
1,Macao,82.8,87.9,10.1 ‰,4.1 ‰
2,Switzerland,81.9,85.9,10.3 ‰,8.2 ‰
3,Iceland,81.8,84.5,13.1 ‰,6.3 ‰
4,Norway,81.7,84.7,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0,61.5,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2,62.0,30.5 ‰,9.1 ‰
117,Somalia,53.2,57.4,43.6 ‰,11.6 ‰
118,Nigeria,52.3,53.1,37.1 ‰,13.1 ‰
119,Chad,50.8,54.3,43.4 ‰,12.5 ‰

In [69]:
mapper = {"Country" : "country","Life expectancy males" : "life_expectancy_males_(years)", "Life expectancy females" : "life_expectancy_females_(years)", "Birth rate" : "birth_rate(%)", "Death rate" : "death_rate(%)"}
df.rename(columns = mapper, inplace = True)

In [70]:
df

,country,life_expectancy_males_(years),life_expectancy_females_(years),birth_rate(%),death_rate(%)
0,Hong Kong,83.2,87.9,5.0 ‰,6.9 ‰
1,Macao,82.8,87.9,10.1 ‰,4.1 ‰
2,Switzerland,81.9,85.9,10.3 ‰,8.2 ‰
3,Iceland,81.8,84.5,13.1 ‰,6.3 ‰
4,Norway,81.7,84.7,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0,61.5,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2,62.0,30.5 ‰,9.1 ‰
117,Somalia,53.2,57.4,43.6 ‰,11.6 ‰
118,Nigeria,52.3,53.1,37.1 ‰,13.1 ‰
119,Chad,50.8,54.3,43.4 ‰,12.5 ‰

In [76]:
df["life_expectancy_males_(years)"] = df["life_expectancy_males_(years)"].astype("float")

In [77]:
df["life_expectancy_females_(years)"] = df["life_expectancy_females_(years)"].astype("float")

In [78]:
df

,country,life_expectancy_males_(years),life_expectancy_females_(years),birth_rate(%),death_rate(%)
0,Hong Kong,83.2,87.9,5.0 ‰,6.9 ‰
1,Macao,82.8,87.9,10.1 ‰,4.1 ‰
2,Switzerland,81.9,85.9,10.3 ‰,8.2 ‰
3,Iceland,81.8,84.5,13.1 ‰,6.3 ‰
4,Norway,81.7,84.7,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0,61.5,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2,62.0,30.5 ‰,9.1 ‰
117,Somalia,53.2,57.4,43.6 ‰,11.6 ‰
118,Nigeria,52.3,53.1,37.1 ‰,13.1 ‰
119,Chad,50.8,54.3,43.4 ‰,12.5 ‰

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   country                          120 non-null    string
 1   life_expectancy_males_(years)    120 non-null    float64
 2   life_expectancy_females_(years)  120 non-null    float64
 3   birth_rate(%)                    120 non-null    object
 4   death_rate(%)                    120 non-null    object
dtypes: float64(2), object(2), string(1)
memory usage: 4.8+ KB

In [82]:
df["birth_rate(%)"] = df["birth_rate(%)"].astype("string")

In [83]:
df["death_rate(%)"] = df["death_rate(%)"].astype("string")

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   country                          120 non-null    string
 1   life_expectancy_males_(years)    120 non-null    float64
 2   life_expectancy_females_(years)  120 non-null    float64
 3   birth_rate(%)                    120 non-null    string
 4   death_rate(%)                    120 non-null    string
dtypes: float64(2), string(3)
memory usage: 4.8 KB

In [90]:
df["birth_rate(%)"] = df["birth_rate(%)"].str.replace("‰", "")

In [91]:
df ["death_rate(%)"] = df["death_rate(%)"].str.replace("‰", "")

In [92]:
df["birth_rate(%)"] = df["birth_rate(%)"].astype("float")

In [93]:
df["death_rate(%)"] = df["death_rate(%)"].astype("float")

In [94]:
df

,country,life_expectancy_males_(years),life_expectancy_females_(years),birth_rate(%),death_rate(%)
0,Hong Kong,83.2,87.9,5.0,6.9
1,Macao,82.8,87.9,10.1,4.1
2,Switzerland,81.9,85.9,10.3,8.2
3,Iceland,81.8,84.5,13.1,6.3
4,Norway,81.7,84.7,10.4,7.8
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0,61.5,42.0,9.7
116,Zimbabwe,56.2,62.0,30.5,9.1
117,Somalia,53.2,57.4,43.6,11.6
118,Nigeria,52.3,53.1,37.1,13.1
119,Chad,50.8,54.3,43.4,12.5

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   country                          120 non-null    string
 1   life_expectancy_males_(years)    120 non-null    float64
 2   life_expectancy_females_(years)  120 non-null    float64
 3   birth_rate(%)                    120 non-null    float64
 4   death_rate(%)                    120 non-null    float64
dtypes: float64(4), string(1)
memory usage: 4.8 KB

In [98]:
df["life_expectancy_males_(years)"].nunique()

100

In [107]:
df["life_expectancy_males_(years)"].min()

50.8

In [108]:
df["life_expectancy_males_(years)"].max()

83.2

In [100]:
df["life_expectancy_males_(years)"].value_counts()

66.1    3
80.6    3
58.9    2
66.3    2
70.3    2
       ..
74.5    1
74.9    1
75.5    1
75.6    1
50.8    1
Name: life_expectancy_males_(years), Length: 100, dtype: int64

In [101]:
df["life_expectancy_females_(years)"].nunique()

98

In [105]:
df["life_expectancy_females_(years)"].max()

87.9

In [106]:
df["life_expectancy_females_(years)"].min()

53.1

In [102]:
df["life_expectancy_males_(years)"].value_counts()

66.1    3
80.6    3
58.9    2
66.3    2
70.3    2
       ..
74.5    1
74.9    1
75.5    1
75.6    1
50.8    1
Name: life_expectancy_males_(years), Length: 100, dtype: int64